run/NACA0015_AoA[0-3]_k-omega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

															
scale 1;														
                                                                
geometry																
{																
}	

vertices
(
               															
	                    ( 0.0 0.0 0.0) // 0
   ( 1.0 0.001574999999999972 0.0) // 1
                   ( 1.0 10.0 0.0) // 2
                  ( -10.0 0.0 0.0) // 3
  ( 15.0 0.001574999999999972 0.0) // 4
                  ( 15.0 10.0 0.0) // 5
  ( 1.0 -0.001574999999999972 0.0) // 6
 ( 15.0 -0.001574999999999972 0.0) // 7
                  ( 1.0 -10.0 0.0) // 8
                 ( 15.0 -10.0 0.0) // 9
                   ( 0.0 0.0 1.0) // 10
  ( 1.0 0.001574999999999972 1.0) // 11
                  ( 1.0 10.0 1.0) // 12
                 ( -10.0 0.0 1.0) // 13
 ( 15.0 0.001574999999999972 1.0) // 14
                 ( 15.0 10.0 1.0) // 15
 ( 1.0 -0.001574999999999972 1.0) // 16
( 15.0 -0.001574999999999972 1.0) // 17
                 ( 1.0 -10.0 1.0) // 18
                ( 15.0 -10.0 1.0) // 19 
        );
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 300 100 1) simpleGrading (1 1000 1)   //block	0
																													
	hex	(1 4 5 2 11 14 15 12)	( 500 100 1) simpleGrading (15 1000 1)  //block	1														
               											
	hex	(6 7 4 1 16 17 14 11)	( 500 10 1) simpleGrading (15 1 1)      //block	2
																																								
	hex	(8 9 7 6 18 19 17 16)	( 500 100 1) simpleGrading (15 0.001 1) //block	3	
	
	hex	(3 8 6 0 13 18 16 10)	( 300 100 1) simpleGrading (1 0.001 1)  //block	4								
);		

edges																
(																
	arc	2 3	(-7 7 0)									
	arc	12 13	(-7 7 1)
	arc	8 3	(-7 -7 0)									
	arc	18 13	(-7 -7 1)									
																
	spline	0 1													
	(					      

                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.003474295807354264 0 ) 
  ( 0.0009866357836101902 0.006900897194089651 0 ) 
  ( 0.0022190176933925554 0.010278435586508464 0 ) 
   ( 0.003942649333762649 0.013605212527232586 0 ) 
   ( 0.006155829688391956 0.016879210134643136 0 ) 
    ( 0.008856374615475837 0.02009810548480725 0 ) 
    ( 0.012041619003218151 0.02325928874270247 0 ) 
   ( 0.015708419399974638 0.026359884824154578 0 ) 
      ( 0.01985315711646002 0.0293967783274895 0 ) 
    ( 0.02447174179695788 0.032366641435026614 0 ) 
    ( 0.029559615456007327 0.03526596444973405 0 ) 
     ( 0.03511175697658486 0.03809108860209008 0 ) 
     ( 0.04112268706534028 0.04083824073683603 0 ) 
   ( 0.047586473659998074 0.043503569469198845 0 ) 
     ( 0.05449673778358616 0.04608318238554507 0 ) 
    ( 0.06184665983971649 0.048573183854479354 0 ) 
     ( 0.06962898634270315 0.05096971301120102 0 ) 
     ( 0.07783603707587677 0.05326898148049159 0 ) 
     ( 0.08645971267103159 0.05546731041194599 0 ) 
     ( 0.0954915026015235 0.057561166414821445 0 ) 
     ( 0.10492249358113281 0.05954719599892877 0 ) 
    ( 0.11474337836040116 0.061422258152017524 0 ) 
     ( 0.12494446491176331 0.06318345471273187 0 ) 
     ( 0.13551568599440833 0.06482815823099591 0 ) 
      ( 0.1464466090894303 0.06635403704412521 0 ) 
      ( 0.1577264466954656 0.06775907733650856 0 ) 
      ( 0.16934406697465365 0.0690416019927722 0 ) 
      ( 0.18128800473841744 0.0702002860983066 0 ) 
      ( 0.1935464727622202 0.07123416898626327 0 ) 
      ( 0.20610737341813284 0.0721426627759611 0 ) 
     ( 0.21895831061373222 0.07292555739341969 0 ) 
       ( 0.2320866020255476 0.0735830221098123 0 ) 
     ( 0.24547929161498316 0.07411560367737127 0 ) 
       ( 0.2591231624143632 0.0745242211840749 0 ) 
       ( 0.273004749570484 0.07481015778772411 0 ) 
        ( 0.287110353632798 0.0749750495262561 0 ) 
     ( 0.30142605407311807 0.07502087143385418 0 ) 
       ( 0.315937723023497 0.07494992122118672 0 ) 
      ( 0.3306310392187286 0.07476480080257945 0 ) 
       ( 0.345491502129707 0.07446839597281081 0 ) 
      ( 0.3605044462736979 0.07406385455130127 0 ) 
      ( 0.3756550556873999 0.07355456332160173 0 ) 
      ( 0.3909283785485107 0.07294412409921208 0 ) 
     ( 0.40630934193137186 0.07223632926088373 0 ) 
      ( 0.4217827666821252 0.07143513706377347 0 ) 
     ( 0.43733338239870584 0.07054464707327461 0 ) 
      ( 0.4529458425008854 0.06956907600428926 0 ) 
       ( 0.468604739375493 0.06851273426241981 0 ) 
      ( 0.4842946195818704 0.06738000344940406 0 ) 
      ( 0.4999999991025516 0.06617531507151302 0 ) 
      ( 0.5157053786241185 0.06490313066103204 0 ) 
      ( 0.5313952588331522 0.06356792348985449 0 ) 
      ( 0.5470541557121839 0.06217416202117017 0 ) 
      ( 0.5626666158205507 0.06072629521077953 0 ) 
      ( 0.5782172315450762 0.05922873973428328 0 ) 
      ( 0.593690656305524 0.057685869180862034 0 ) 
      ( 0.6090716196998196 0.05610200521914075 0 ) 
     ( 0.6243449425740935 0.054481410706294954 0 ) 
      ( 0.6394955520026742 0.05282828467862725 0 ) 
     ( 0.6545084961632448 0.051146759130845154 0 ) 
     ( 0.6693689590924875 0.049440897462661726 0 ) 
     ( 0.6840622753076503 0.047714694445556816 0 ) 
      ( 0.6985739442796073 0.04597207753994403 0 ) 
      ( 0.7128896447431308 0.04421690937391109 0 ) 
      ( 0.7269952488302514 0.04245299117939295 0 ) 
      ( 0.7408768360127569 0.04068406697029154 0 ) 
      ( 0.7545207068400739 0.03891382823979471 0 ) 
     ( 0.7679133964589709 0.037145918951030726 0 ) 
      ( 0.7810416879017434 0.03538394059620823 0 ) 
     ( 0.7938926251297652 0.033631457104451354 0 ) 
      ( 0.8064535258195331 0.03189199938750375 0 ) 
     ( 0.8187119938785907 0.030169069325129978 0 ) 
     ( 0.8306559316789744 0.028466143008119168 0 ) 
     ( 0.8422735519961111 0.026786673075968485 0 ) 
       ( 0.853553389641386 0.02513409000822657 0 ) 
        ( 0.8644843127769004 0.023511802252686 0 ) 
     ( 0.8750555339012502 0.021923195099689107 0 ) 
      ( 0.8852566204954886 0.02037162823926971 0 ) 
     ( 0.8950775053187623 0.018860431966205456 0 ) 
     ( 0.9045084963434626 0.017392902026789243 0 ) 
      ( 0.9135402863200868 0.01597229312974187 0 ) 
     ( 0.9221639619623694 0.014601811171675442 0 ) 
     ( 0.9303710127436202 0.013284604254392379 0 ) 
     ( 0.9381533392955854 0.012023752596605439 0 ) 
     ( 0.9455032614015477 0.010822257465953338 0 ) 
     ( 0.9524135255757721 0.009683029278069312 0 ) 
     ( 0.9588773122218202 0.008608875027584279 0 ) 
     ( 0.9648882423626697 0.007602485231006629 0 ) 
     ( 0.9704403839359932 0.006666420573171325 0 ) 
    ( 0.9755282576483886 0.0058030984572009425 0 ) 
     ( 0.9801468423827797 0.005014779662538531 0 ) 
     ( 0.9842915801536527 0.004303555316538469 0 ) 
     ( 0.9879583806052372 0.003671334382325114 0 ) 
     ( 0.9911436250481941 0.003119831859224153 0 ) 
    ( 0.9938441700308243 0.0026505578821515888 0 ) 
    ( 0.9960573504412771 0.0022648078931056244 0 ) 
      ( 0.9977809821376927 0.00196365404158463 0 ) 
    ( 0.9990133641036874 0.0017479379516431163 0 ) 
    ( 0.9997532801270506 0.0016182649717501327 0 ) 
                    ( 1.0 0.001574999999999972 0 )  
    )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.003474295807354264 1 ) 
  ( 0.0009866357836101902 0.006900897194089651 1 ) 
  ( 0.0022190176933925554 0.010278435586508464 1 ) 
   ( 0.003942649333762649 0.013605212527232586 1 ) 
   ( 0.006155829688391956 0.016879210134643136 1 ) 
    ( 0.008856374615475837 0.02009810548480725 1 ) 
    ( 0.012041619003218151 0.02325928874270247 1 ) 
   ( 0.015708419399974638 0.026359884824154578 1 ) 
      ( 0.01985315711646002 0.0293967783274895 1 ) 
    ( 0.02447174179695788 0.032366641435026614 1 ) 
    ( 0.029559615456007327 0.03526596444973405 1 ) 
     ( 0.03511175697658486 0.03809108860209008 1 ) 
     ( 0.04112268706534028 0.04083824073683603 1 ) 
   ( 0.047586473659998074 0.043503569469198845 1 ) 
     ( 0.05449673778358616 0.04608318238554507 1 ) 
    ( 0.06184665983971649 0.048573183854479354 1 ) 
     ( 0.06962898634270315 0.05096971301120102 1 ) 
     ( 0.07783603707587677 0.05326898148049159 1 ) 
     ( 0.08645971267103159 0.05546731041194599 1 ) 
     ( 0.0954915026015235 0.057561166414821445 1 ) 
     ( 0.10492249358113281 0.05954719599892877 1 ) 
    ( 0.11474337836040116 0.061422258152017524 1 ) 
     ( 0.12494446491176331 0.06318345471273187 1 ) 
     ( 0.13551568599440833 0.06482815823099591 1 ) 
      ( 0.1464466090894303 0.06635403704412521 1 ) 
      ( 0.1577264466954656 0.06775907733650856 1 ) 
      ( 0.16934406697465365 0.0690416019927722 1 ) 
      ( 0.18128800473841744 0.0702002860983066 1 ) 
      ( 0.1935464727622202 0.07123416898626327 1 ) 
      ( 0.20610737341813284 0.0721426627759611 1 ) 
     ( 0.21895831061373222 0.07292555739341969 1 ) 
       ( 0.2320866020255476 0.0735830221098123 1 ) 
     ( 0.24547929161498316 0.07411560367737127 1 ) 
       ( 0.2591231624143632 0.0745242211840749 1 ) 
       ( 0.273004749570484 0.07481015778772411 1 ) 
        ( 0.287110353632798 0.0749750495262561 1 ) 
     ( 0.30142605407311807 0.07502087143385418 1 ) 
       ( 0.315937723023497 0.07494992122118672 1 ) 
      ( 0.3306310392187286 0.07476480080257945 1 ) 
       ( 0.345491502129707 0.07446839597281081 1 ) 
      ( 0.3605044462736979 0.07406385455130127 1 ) 
      ( 0.3756550556873999 0.07355456332160173 1 ) 
      ( 0.3909283785485107 0.07294412409921208 1 ) 
     ( 0.40630934193137186 0.07223632926088373 1 ) 
      ( 0.4217827666821252 0.07143513706377347 1 ) 
     ( 0.43733338239870584 0.07054464707327461 1 ) 
      ( 0.4529458425008854 0.06956907600428926 1 ) 
       ( 0.468604739375493 0.06851273426241981 1 ) 
      ( 0.4842946195818704 0.06738000344940406 1 ) 
      ( 0.4999999991025516 0.06617531507151302 1 ) 
      ( 0.5157053786241185 0.06490313066103204 1 ) 
      ( 0.5313952588331522 0.06356792348985449 1 ) 
      ( 0.5470541557121839 0.06217416202117017 1 ) 
      ( 0.5626666158205507 0.06072629521077953 1 ) 
      ( 0.5782172315450762 0.05922873973428328 1 ) 
      ( 0.593690656305524 0.057685869180862034 1 ) 
      ( 0.6090716196998196 0.05610200521914075 1 ) 
     ( 0.6243449425740935 0.054481410706294954 1 ) 
      ( 0.6394955520026742 0.05282828467862725 1 ) 
     ( 0.6545084961632448 0.051146759130845154 1 ) 
     ( 0.6693689590924875 0.049440897462661726 1 ) 
     ( 0.6840622753076503 0.047714694445556816 1 ) 
      ( 0.6985739442796073 0.04597207753994403 1 ) 
      ( 0.7128896447431308 0.04421690937391109 1 ) 
      ( 0.7269952488302514 0.04245299117939295 1 ) 
      ( 0.7408768360127569 0.04068406697029154 1 ) 
      ( 0.7545207068400739 0.03891382823979471 1 ) 
     ( 0.7679133964589709 0.037145918951030726 1 ) 
      ( 0.7810416879017434 0.03538394059620823 1 ) 
     ( 0.7938926251297652 0.033631457104451354 1 ) 
      ( 0.8064535258195331 0.03189199938750375 1 ) 
     ( 0.8187119938785907 0.030169069325129978 1 ) 
     ( 0.8306559316789744 0.028466143008119168 1 ) 
     ( 0.8422735519961111 0.026786673075968485 1 ) 
       ( 0.853553389641386 0.02513409000822657 1 ) 
        ( 0.8644843127769004 0.023511802252686 1 ) 
     ( 0.8750555339012502 0.021923195099689107 1 ) 
      ( 0.8852566204954886 0.02037162823926971 1 ) 
     ( 0.8950775053187623 0.018860431966205456 1 ) 
     ( 0.9045084963434626 0.017392902026789243 1 ) 
      ( 0.9135402863200868 0.01597229312974187 1 ) 
     ( 0.9221639619623694 0.014601811171675442 1 ) 
     ( 0.9303710127436202 0.013284604254392379 1 ) 
     ( 0.9381533392955854 0.012023752596605439 1 ) 
     ( 0.9455032614015477 0.010822257465953338 1 ) 
     ( 0.9524135255757721 0.009683029278069312 1 ) 
     ( 0.9588773122218202 0.008608875027584279 1 ) 
     ( 0.9648882423626697 0.007602485231006629 1 ) 
     ( 0.9704403839359932 0.006666420573171325 1 ) 
    ( 0.9755282576483886 0.0058030984572009425 1 ) 
     ( 0.9801468423827797 0.005014779662538531 1 ) 
     ( 0.9842915801536527 0.004303555316538469 1 ) 
     ( 0.9879583806052372 0.003671334382325114 1 ) 
     ( 0.9911436250481941 0.003119831859224153 1 ) 
    ( 0.9938441700308243 0.0026505578821515888 1 ) 
    ( 0.9960573504412771 0.0022648078931056244 1 ) 
      ( 0.9977809821376927 0.00196365404158463 1 ) 
    ( 0.9990133641036874 0.0017479379516431163 1 ) 
    ( 0.9997532801270506 0.0016182649717501327 1 ) 
                    ( 1.0 0.001574999999999972 1 )  
	)																																																													
	spline	0	6													
	(
                                         ( 0.0 -0.0 0 ) 
 ( 0.00024671981657042874 -0.003474295807354264 0 ) 
  ( 0.0009866357836101902 -0.006900897194089651 0 ) 
  ( 0.0022190176933925554 -0.010278435586508464 0 ) 
   ( 0.003942649333762649 -0.013605212527232586 0 ) 
   ( 0.006155829688391956 -0.016879210134643136 0 ) 
    ( 0.008856374615475837 -0.02009810548480725 0 ) 
    ( 0.012041619003218151 -0.02325928874270247 0 ) 
   ( 0.015708419399974638 -0.026359884824154578 0 ) 
      ( 0.01985315711646002 -0.0293967783274895 0 ) 
    ( 0.02447174179695788 -0.032366641435026614 0 ) 
    ( 0.029559615456007327 -0.03526596444973405 0 ) 
     ( 0.03511175697658486 -0.03809108860209008 0 ) 
     ( 0.04112268706534028 -0.04083824073683603 0 ) 
   ( 0.047586473659998074 -0.043503569469198845 0 ) 
     ( 0.05449673778358616 -0.04608318238554507 0 ) 
    ( 0.06184665983971649 -0.048573183854479354 0 ) 
     ( 0.06962898634270315 -0.05096971301120102 0 ) 
     ( 0.07783603707587677 -0.05326898148049159 0 ) 
     ( 0.08645971267103159 -0.05546731041194599 0 ) 
     ( 0.0954915026015235 -0.057561166414821445 0 ) 
     ( 0.10492249358113281 -0.05954719599892877 0 ) 
    ( 0.11474337836040116 -0.061422258152017524 0 ) 
     ( 0.12494446491176331 -0.06318345471273187 0 ) 
     ( 0.13551568599440833 -0.06482815823099591 0 ) 
      ( 0.1464466090894303 -0.06635403704412521 0 ) 
      ( 0.1577264466954656 -0.06775907733650856 0 ) 
      ( 0.16934406697465365 -0.0690416019927722 0 ) 
      ( 0.18128800473841744 -0.0702002860983066 0 ) 
      ( 0.1935464727622202 -0.07123416898626327 0 ) 
      ( 0.20610737341813284 -0.0721426627759611 0 ) 
     ( 0.21895831061373222 -0.07292555739341969 0 ) 
       ( 0.2320866020255476 -0.0735830221098123 0 ) 
     ( 0.24547929161498316 -0.07411560367737127 0 ) 
       ( 0.2591231624143632 -0.0745242211840749 0 ) 
       ( 0.273004749570484 -0.07481015778772411 0 ) 
        ( 0.287110353632798 -0.0749750495262561 0 ) 
     ( 0.30142605407311807 -0.07502087143385418 0 ) 
       ( 0.315937723023497 -0.07494992122118672 0 ) 
      ( 0.3306310392187286 -0.07476480080257945 0 ) 
       ( 0.345491502129707 -0.07446839597281081 0 ) 
      ( 0.3605044462736979 -0.07406385455130127 0 ) 
      ( 0.3756550556873999 -0.07355456332160173 0 ) 
      ( 0.3909283785485107 -0.07294412409921208 0 ) 
     ( 0.40630934193137186 -0.07223632926088373 0 ) 
      ( 0.4217827666821252 -0.07143513706377347 0 ) 
     ( 0.43733338239870584 -0.07054464707327461 0 ) 
      ( 0.4529458425008854 -0.06956907600428926 0 ) 
       ( 0.468604739375493 -0.06851273426241981 0 ) 
      ( 0.4842946195818704 -0.06738000344940406 0 ) 
      ( 0.4999999991025516 -0.06617531507151302 0 ) 
      ( 0.5157053786241185 -0.06490313066103204 0 ) 
      ( 0.5313952588331522 -0.06356792348985449 0 ) 
      ( 0.5470541557121839 -0.06217416202117017 0 ) 
      ( 0.5626666158205507 -0.06072629521077953 0 ) 
      ( 0.5782172315450762 -0.05922873973428328 0 ) 
      ( 0.593690656305524 -0.057685869180862034 0 ) 
      ( 0.6090716196998196 -0.05610200521914075 0 ) 
     ( 0.6243449425740935 -0.054481410706294954 0 ) 
      ( 0.6394955520026742 -0.05282828467862725 0 ) 
     ( 0.6545084961632448 -0.051146759130845154 0 ) 
     ( 0.6693689590924875 -0.049440897462661726 0 ) 
     ( 0.6840622753076503 -0.047714694445556816 0 ) 
      ( 0.6985739442796073 -0.04597207753994403 0 ) 
      ( 0.7128896447431308 -0.04421690937391109 0 ) 
      ( 0.7269952488302514 -0.04245299117939295 0 ) 
      ( 0.7408768360127569 -0.04068406697029154 0 ) 
      ( 0.7545207068400739 -0.03891382823979471 0 ) 
     ( 0.7679133964589709 -0.037145918951030726 0 ) 
      ( 0.7810416879017434 -0.03538394059620823 0 ) 
     ( 0.7938926251297652 -0.033631457104451354 0 ) 
      ( 0.8064535258195331 -0.03189199938750375 0 ) 
     ( 0.8187119938785907 -0.030169069325129978 0 ) 
     ( 0.8306559316789744 -0.028466143008119168 0 ) 
     ( 0.8422735519961111 -0.026786673075968485 0 ) 
       ( 0.853553389641386 -0.02513409000822657 0 ) 
        ( 0.8644843127769004 -0.023511802252686 0 ) 
     ( 0.8750555339012502 -0.021923195099689107 0 ) 
      ( 0.8852566204954886 -0.02037162823926971 0 ) 
     ( 0.8950775053187623 -0.018860431966205456 0 ) 
     ( 0.9045084963434626 -0.017392902026789243 0 ) 
      ( 0.9135402863200868 -0.01597229312974187 0 ) 
     ( 0.9221639619623694 -0.014601811171675442 0 ) 
     ( 0.9303710127436202 -0.013284604254392379 0 ) 
     ( 0.9381533392955854 -0.012023752596605439 0 ) 
     ( 0.9455032614015477 -0.010822257465953338 0 ) 
     ( 0.9524135255757721 -0.009683029278069312 0 ) 
     ( 0.9588773122218202 -0.008608875027584279 0 ) 
     ( 0.9648882423626697 -0.007602485231006629 0 ) 
     ( 0.9704403839359932 -0.006666420573171325 0 ) 
    ( 0.9755282576483886 -0.0058030984572009425 0 ) 
     ( 0.9801468423827797 -0.005014779662538531 0 ) 
     ( 0.9842915801536527 -0.004303555316538469 0 ) 
     ( 0.9879583806052372 -0.003671334382325114 0 ) 
     ( 0.9911436250481941 -0.003119831859224153 0 ) 
    ( 0.9938441700308243 -0.0026505578821515888 0 ) 
    ( 0.9960573504412771 -0.0022648078931056244 0 ) 
      ( 0.9977809821376927 -0.00196365404158463 0 ) 
    ( 0.9990133641036874 -0.0017479379516431163 0 ) 
    ( 0.9997532801270506 -0.0016182649717501327 0 ) 
                    ( 1.0 -0.001574999999999972 0 )  
    )
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.003474295807354264 1 ) 
  ( 0.0009866357836101902 -0.006900897194089651 1 ) 
  ( 0.0022190176933925554 -0.010278435586508464 1 ) 
   ( 0.003942649333762649 -0.013605212527232586 1 ) 
   ( 0.006155829688391956 -0.016879210134643136 1 ) 
    ( 0.008856374615475837 -0.02009810548480725 1 ) 
    ( 0.012041619003218151 -0.02325928874270247 1 ) 
   ( 0.015708419399974638 -0.026359884824154578 1 ) 
      ( 0.01985315711646002 -0.0293967783274895 1 ) 
    ( 0.02447174179695788 -0.032366641435026614 1 ) 
    ( 0.029559615456007327 -0.03526596444973405 1 ) 
     ( 0.03511175697658486 -0.03809108860209008 1 ) 
     ( 0.04112268706534028 -0.04083824073683603 1 ) 
   ( 0.047586473659998074 -0.043503569469198845 1 ) 
     ( 0.05449673778358616 -0.04608318238554507 1 ) 
    ( 0.06184665983971649 -0.048573183854479354 1 ) 
     ( 0.06962898634270315 -0.05096971301120102 1 ) 
     ( 0.07783603707587677 -0.05326898148049159 1 ) 
     ( 0.08645971267103159 -0.05546731041194599 1 ) 
     ( 0.0954915026015235 -0.057561166414821445 1 ) 
     ( 0.10492249358113281 -0.05954719599892877 1 ) 
    ( 0.11474337836040116 -0.061422258152017524 1 ) 
     ( 0.12494446491176331 -0.06318345471273187 1 ) 
     ( 0.13551568599440833 -0.06482815823099591 1 ) 
      ( 0.1464466090894303 -0.06635403704412521 1 ) 
      ( 0.1577264466954656 -0.06775907733650856 1 ) 
      ( 0.16934406697465365 -0.0690416019927722 1 ) 
      ( 0.18128800473841744 -0.0702002860983066 1 ) 
      ( 0.1935464727622202 -0.07123416898626327 1 ) 
      ( 0.20610737341813284 -0.0721426627759611 1 ) 
     ( 0.21895831061373222 -0.07292555739341969 1 ) 
       ( 0.2320866020255476 -0.0735830221098123 1 ) 
     ( 0.24547929161498316 -0.07411560367737127 1 ) 
       ( 0.2591231624143632 -0.0745242211840749 1 ) 
       ( 0.273004749570484 -0.07481015778772411 1 ) 
        ( 0.287110353632798 -0.0749750495262561 1 ) 
     ( 0.30142605407311807 -0.07502087143385418 1 ) 
       ( 0.315937723023497 -0.07494992122118672 1 ) 
      ( 0.3306310392187286 -0.07476480080257945 1 ) 
       ( 0.345491502129707 -0.07446839597281081 1 ) 
      ( 0.3605044462736979 -0.07406385455130127 1 ) 
      ( 0.3756550556873999 -0.07355456332160173 1 ) 
      ( 0.3909283785485107 -0.07294412409921208 1 ) 
     ( 0.40630934193137186 -0.07223632926088373 1 ) 
      ( 0.4217827666821252 -0.07143513706377347 1 ) 
     ( 0.43733338239870584 -0.07054464707327461 1 ) 
      ( 0.4529458425008854 -0.06956907600428926 1 ) 
       ( 0.468604739375493 -0.06851273426241981 1 ) 
      ( 0.4842946195818704 -0.06738000344940406 1 ) 
      ( 0.4999999991025516 -0.06617531507151302 1 ) 
      ( 0.5157053786241185 -0.06490313066103204 1 ) 
      ( 0.5313952588331522 -0.06356792348985449 1 ) 
      ( 0.5470541557121839 -0.06217416202117017 1 ) 
      ( 0.5626666158205507 -0.06072629521077953 1 ) 
      ( 0.5782172315450762 -0.05922873973428328 1 ) 
      ( 0.593690656305524 -0.057685869180862034 1 ) 
      ( 0.6090716196998196 -0.05610200521914075 1 ) 
     ( 0.6243449425740935 -0.054481410706294954 1 ) 
      ( 0.6394955520026742 -0.05282828467862725 1 ) 
     ( 0.6545084961632448 -0.051146759130845154 1 ) 
     ( 0.6693689590924875 -0.049440897462661726 1 ) 
     ( 0.6840622753076503 -0.047714694445556816 1 ) 
      ( 0.6985739442796073 -0.04597207753994403 1 ) 
      ( 0.7128896447431308 -0.04421690937391109 1 ) 
      ( 0.7269952488302514 -0.04245299117939295 1 ) 
      ( 0.7408768360127569 -0.04068406697029154 1 ) 
      ( 0.7545207068400739 -0.03891382823979471 1 ) 
     ( 0.7679133964589709 -0.037145918951030726 1 ) 
      ( 0.7810416879017434 -0.03538394059620823 1 ) 
     ( 0.7938926251297652 -0.033631457104451354 1 ) 
      ( 0.8064535258195331 -0.03189199938750375 1 ) 
     ( 0.8187119938785907 -0.030169069325129978 1 ) 
     ( 0.8306559316789744 -0.028466143008119168 1 ) 
     ( 0.8422735519961111 -0.026786673075968485 1 ) 
       ( 0.853553389641386 -0.02513409000822657 1 ) 
        ( 0.8644843127769004 -0.023511802252686 1 ) 
     ( 0.8750555339012502 -0.021923195099689107 1 ) 
      ( 0.8852566204954886 -0.02037162823926971 1 ) 
     ( 0.8950775053187623 -0.018860431966205456 1 ) 
     ( 0.9045084963434626 -0.017392902026789243 1 ) 
      ( 0.9135402863200868 -0.01597229312974187 1 ) 
     ( 0.9221639619623694 -0.014601811171675442 1 ) 
     ( 0.9303710127436202 -0.013284604254392379 1 ) 
     ( 0.9381533392955854 -0.012023752596605439 1 ) 
     ( 0.9455032614015477 -0.010822257465953338 1 ) 
     ( 0.9524135255757721 -0.009683029278069312 1 ) 
     ( 0.9588773122218202 -0.008608875027584279 1 ) 
     ( 0.9648882423626697 -0.007602485231006629 1 ) 
     ( 0.9704403839359932 -0.006666420573171325 1 ) 
    ( 0.9755282576483886 -0.0058030984572009425 1 ) 
     ( 0.9801468423827797 -0.005014779662538531 1 ) 
     ( 0.9842915801536527 -0.004303555316538469 1 ) 
     ( 0.9879583806052372 -0.003671334382325114 1 ) 
     ( 0.9911436250481941 -0.003119831859224153 1 ) 
    ( 0.9938441700308243 -0.0026505578821515888 1 ) 
    ( 0.9960573504412771 -0.0022648078931056244 1 ) 
      ( 0.9977809821376927 -0.00196365404158463 1 ) 
    ( 0.9990133641036874 -0.0017479379516431163 1 ) 
    ( 0.9997532801270506 -0.0016182649717501327 1 ) 
                    ( 1.0 -0.001574999999999972 1 )  
							
    )															
                                                                    
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                                                                                
    boundary																
    (																
        inlet              																
            {																
            type patch;    																
            faces																
            (																
                (3 13 12 2)
                (8 18 13 3)
                (5 2 12 15)
                (8 9 19 18)															
            );																
            } 
        outlet              																
            {																
            type patch;    																
            faces																
            (																
                (4 5 15 14)
                (7 4 14 17)
                (7 17 19 9)  															
            );																
            }	

        foil              																
            {																
            type wall;    																
            faces																
            (																
                (0 1 11 10)
                (0 6 16 10)
                (6 1 11 16)															
            );																
            }	
                                                                
                                                                        
    );	
    // ************************************************************************* //																
                                                                    			               	
    