run/NACA0015_AoA[0-3]_k-omega/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
165000
(
4.83211e-05
8.45967e-06
3.7817e-05
4.27282e-06
8.07974e-06
2.74271e-05
4.63941e-06
4.29128e-06
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    foil
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
610
(
1.56634
1.16987
0.533259
0.577998
0.385606
0.197454
0.123227
0.0971075
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
