run/NACA0015_AoA[0-3]_k-omega/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
165000
(
701.668
265.859
605.709
284.326
253.991
496.487
326.279
299.416
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    foil
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
610
(
17239.9
16751.8
12405.3
13290.2
13612.2
12997.4
13433.9
14714.6
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
